reddit/app/controllers/users_controller.rb

    def edit
        # brings up the page
        @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def destroy
        @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]